package Homework14.TaskC;

public class QuestionsOOP {
    public static void main(String[] args) {
/**
 * 1 - Что такое парадигма програмирование?
 * Answer: Основная концепция парадигмы ООП - являются понятия объектов и классов
 * 2 -Что такое классы в Java
 * Answer: Классы - это шаблон для созднаие обЪeктов.
 * Класс определяет структуру и поведение, которые будут совместно использоваться набором объектов.
 * Класс содержит переменные и методы, которые называются элементами класса
 * Каждый объект данного класса содержит структуру и поведение, которые определены классом
 * Обьекты - это экземпляр класса,
 * которой можно посылать сообщения и которая может на них реагировать, используя свои данные
 * 3 - Что такое свойства класса?
 *Answer: Это переменные которые описывают общие характеристеки и действие класса
 *
 * - Напишите код для примеров ниже:
 *  1 - Как создать экземпляр класса (обьект)?
 *  Answer: Класс названиеОбьекта = new Класс();
 *  2 - Как создать свойства для определенного класса?
 *  Answer:
 *  public class Class{
 *  //Люыбе типы данных, ссылочные или примитывные
 *  int age
 *  String name
 *  boolean gender
 *  3 - Как задать свойства?
 *  Answer:
 *  public class Class{
 *  String name;
 *  public static void main(String[] args){
 *      Class class = new Class();
 *      class.name = "Azat";
 *      }
 *  }
 *  4 - Как получить определленное свойства класса?
 *  Answer:
 *  public class Class{
 *   String name;
 *   int age;
 *  *  public static void main(String[] args){
 *  *      Class class = new Class();
 *  *      class.name = "Azat";
 *  *      class.age = 18;
 *  *       System.out.println("Имя" + name);
 *  *       System.out.println("возраст" + age);
 *  *      }
 *  *  }
 */
    }
}
